Revit 2027 API
FormattedText.AsTextRange Method
 Returns a TextRange object that represents the entire text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TextRange AsTextRange()
Public Function AsTextRange As TextRange
public:
TextRange^ AsTextRange()
member AsTextRange : unit -> TextRange
Return Value
TextRange
 The TextRange object that represents the entire text.
Remarks
 This range includes a carriage return character ('\r') that is always present. As a result the range can never be an empty range.
Example
public void AppendText(TextNote textNote)
{
    FormattedText formatText = textNote.GetFormattedText();
    TextRange range = formatText.AsTextRange();
    range.Start = range.End - 1;
    // set Length to 0 to insert
    range.Length = 0;
    string someNewText = "\rThis is a new paragraph\vThis is a new line without a paragraph break\r";
    formatText.SetPlainText(range, someNewText);
    // get range for entire text
    range = formatText.AsTextRange();
    range.Start = range.End - 1;
    range.Length = 0;
    string someListText = "\rBulleted List item 1\rItem 2\vSecond line for Item 2\rThird bullet point";
    formatText.SetPlainText(range, someListText);
    range.Start++;
    range.Length = someListText.Length;
    formatText.SetListType(range, ListType.Bullet);
    if (formatText.GetAllCapsStatus(range) != FormatStatus.None)
    {
        formatText.SetAllCapsStatus(range, false);
    }
    textNote.SetFormattedText(formatText);
}
See Also
Reference
FormattedText Class
Autodesk.Revit.DB Namespace